{
  "architectures": [
    "LLaDA2MoeModelLM"
  ],
  "auto_map": {
    "AutoConfig": "configuration_llada2uni_moe.LLaDA2MoeConfig",
    "AutoModel": "modeling_llada2uni_moe.LLaDA2MoeModelLM",
    "AutoModelForCausalLM": "modeling_llada2uni_moe.LLaDA2MoeModelLM"
  },
  "model_type": "llada2_moe",
  "torch_dtype": "bfloat16",
  "transformers_version": "4.51.0",
  "vocab_size": 173568,
  "hidden_size": 2048,
  "intermediate_size": 5120,
  "num_hidden_layers": 20,
  "num_attention_heads": 16,
  "num_key_value_heads": 4,
  "head_dim": 128,
  "hidden_act": "silu",
  "use_qkv_bias": false,
  "use_qk_norm": true,
  "use_bias": false,
  "rms_norm_eps": 1e-06,
  "attention_dropout": 0.0,
  "initializer_range": 0.02,
  "max_position_embeddings": 8192,
  "rope_theta": 600000,
  "rope_parameters": {
    "rope_type": "default",
    "rope_theta": 600000,
    "partial_rotary_factor": 0.5
  },
  "partial_rotary_factor": 0.5,
  "use_cache": false,
  "sliding_window": null,
  "pad_token_id": 156892,
  "num_experts": 256,
  "num_shared_experts": 1,
  "num_experts_per_tok": 8,
  "n_group": 8,
  "topk_group": 4,
  "routed_scaling_factor": 2.5,
  "moe_intermediate_size": 512,
  "first_k_dense_replace": 1,
  "output_router_logits": false,
  "image_token_offset": 157184
}